using Microsoft.Win32.SafeHandles;
using System;
using System.ComponentModel;
using System.Diagnostics;
using System.Runtime.CompilerServices;
using System.Runtime.ConstrainedExecution;
using System.Runtime.InteropServices;
using System.Runtime.InteropServices.ComTypes;
using System.Security;
using System.Text;
using Silverton.Core.Image;
using Silverton.Core.Log;

namespace Silverton.Core.Interop {

    // Native interop APIs and data structures
    public static class NativeBridge {

        public const uint PAGE_EXECUTE_READWRITE = 0x40;
        public const uint PAGE_READWRITE = 0x04;
        public const uint PAGE_EXECUTE_READ = 0x20;
        public const uint PAGE_EXECUTE = 0x10;
        public const uint PAGE_EXECUTE_WRITECOPY = 0x80;
        public const uint PAGE_NOACCESS = 0x01;
        public const uint PAGE_READONLY = 0x02;
        public const uint PAGE_WRITECOPY = 0x08;

        public const uint MEM_COMMIT = 0x1000;
        public const uint MEM_RESERVE = 0x2000;
        public const uint MEM_RELEASE = 0x00008000;

        public const uint IMAGE_SCN_MEM_EXECUTE = 0x20000000;
        public const uint IMAGE_SCN_MEM_READ = 0x40000000;
        public const uint IMAGE_SCN_MEM_WRITE = 0x80000000;

        public const UInt32 DLL_PROCESS_DETACH = 0;
        public const UInt32 DLL_PROCESS_ATTACH = 1;
        public const UInt32 DLL_THREAD_ATTACH = 2;
        public const UInt32 DLL_THREAD_DETACH = 3;

        public const int STD_INPUT_HANDLE = -10;
        public const int STD_OUTPUT_HANDLE = -11;
        public const int STD_ERROR_HANDLE = -12;

        [Flags]
        public enum LoadLibraryFlags : uint {
            DONT_RESOLVE_DLL_REFERENCES = 0x00000001,
            LOAD_IGNORE_CODE_AUTHZ_LEVEL = 0x00000010,
            LOAD_LIBRARY_AS_DATAFILE = 0x00000002,
            LOAD_LIBRARY_AS_DATAFILE_EXCLUSIVE = 0x00000040,
            LOAD_LIBRARY_AS_IMAGE_RESOURCE = 0x00000020,
            LOAD_WITH_ALTERED_SEARCH_PATH = 0x00000008
        }

        public static class StartUpFlags {
            public const int STARTF_USESTDHANDLES = 0x00000100;
        }

        public static class DuplicateHandleOptions {
            public const int DUPLICATE_CLOSE_SOURCE = 0x00000001;
            public const int DUPLICATE_SAME_ACCESS = 0x00000002;
            public const int DUPLICATE_SAME_ATTRIBUTES = 0x00000004;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct IMAGE_BASE_RELOCATION {
            public uint BaseOffset;
            public uint SizeOfBlock;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct PROCESS_BASIC_INFORMATION {
            public int ExitStatus;
            public IntPtr PebAddress;
            public IntPtr AffinityMask;
            public int BasePriority;
            public IntPtr UniquePID;
            public IntPtr InheritedFromUniqueProcessId;
        }


        [StructLayout(LayoutKind.Explicit)]
        public struct PEB {
            [FieldOffset(0x2)]
            public byte BeingDebugged;
            [FieldOffset(0x10)]
            public IntPtr ImageBaseAddress;
            [FieldOffset(0x18)]
            public IntPtr Ldr;
            [FieldOffset(0xbc)]
            public uint NtGlobalFlag;
            [FieldOffset(0x7c4)]
            public uint NtGlobalFlag2;
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct PEB_LDR_DATA {
            [FieldOffset(0x00)]
            public ulong Length;
            [FieldOffset(0x04)]
            public bool Initialized;
            [FieldOffset(0x08)]
            public IntPtr SsHandle;
            [FieldOffset(0x10)]
            public LIST_ENTRY InLoadOrderLinks; // 0x10
            [FieldOffset(0x20)]
            public LIST_ENTRY InMemoryOrderLinks; // 0x20
            [FieldOffset(0x30)]
            public LIST_ENTRY InInitializationOrderLinks; // 0x30
            [FieldOffset(0x40)]
            public IntPtr EntryInProgress;
            [FieldOffset(0x48)]
            public byte ShutdownInProgress;
            [FieldOffset(0x50)]
            public IntPtr ShutdownThreadId;
        }

        [StructLayout(LayoutKind.Sequential, Pack = 1)]
        public struct LIST_ENTRY {
            public IntPtr Flink;
            public IntPtr Blink;
        }

        [StructLayout(LayoutKind.Sequential, CharSet = CharSet.Unicode)]
        public struct CRITICAL_SECTION {
            IntPtr DebugInfo;
            long LockCount;
            long RecursionCount;
            IntPtr OwningThread;
            IntPtr LockSemaphore;
            ulong SpinCount;
        }
        public enum LDR_DATA_TABLE_ENTRY_FLAGS : uint {
            LDRP_PACKAGED_BINARY = 0x00000001,
            LDRP_MARKED_FOR_REMOVAL = 0x00000002,
            LDRP_IMAGE_DLL = 0x00000004,
            LDRP_LOAD_NOTIFICATIONS_SENT = 0x00000008,
            LDRP_TELEMETRY_ENTRY_PROCESSED = 0x00000010,
            LDRP_PROCESS_STATIC_IMPORT = 0x00000020,
            LDRP_IN_LEGACY_LISTS = 0x00000040,
            LDRP_IN_INDEXES = 0x00000080,
            LDRP_SHIM_DLL = 0x00000100,
            LDRP_IN_EXCEPTION_TABLE = 0x00000200,
            LDRP_LOAD_IN_PROGRESS = 0x00001000,
            LDRP_LOAD_CONFIG_PROCESSED = 0x00002000,
            LDRP_ENTRY_PROCESSED = 0x00004000,
            LDRP_PROTECT_DELAY_LOAD = 0x00008000,
            LDRP_DONT_CALL_FOR_THREADS = 0x00040000,
            LDRP_PROCESS_ATTACH_CALLED = 0x00080000,
            LDRP_PROCESS_ATTACH_FAILED = 0x00100000,
            LDRP_COR_DEFERRED_VALIDATE = 0x00200000,
            LDRP_COR_IMAGE = 0x00400000,
            LDRP_DONT_RELOCATE = 0x00800000,
            LDRP_COR_IL_ONLY = 0x01000000,
            LDRP_CHPE_IMAGE = 0x02000000,
            LDRP_CHPE_EMULATOR_IMAGE = 0x04000000,
            LDRP_REDIRECTED = 0x10000000,
            LDRP_COMPAT_DATABASE_PROCESSED = 0x80000000
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct LDR_DATA_TABLE_ENTRY {
            [FieldOffset(0)]
            public LIST_ENTRY InLoadOrderLinks;
            [FieldOffset(0x10)]
            public LIST_ENTRY InMemoryOrderLinks;
            [FieldOffset(0x20)]
            public LIST_ENTRY InInitializationOrderLinks;
            [FieldOffset(0x30)]
            public IntPtr DllBase;
            [FieldOffset(0x38)]
            public IntPtr EntryPoint;
            [FieldOffset(0x40)]
            public uint SizeOfImage;
            [FieldOffset(0x48)]
            public UNICODE_STRING FullDllName;
            [FieldOffset(0x58)]
            public UNICODE_STRING BaseDllName;
            [FieldOffset(0x68)]
            public uint Flags;
            [FieldOffset(0x6C)]
            public ushort ObsoleteLoadCount;
            [FieldOffset(0x6E)]
            public ushort TlsIndex;
            [FieldOffset(0x70)]
            public LIST_ENTRY HashLinks;
            [FieldOffset(0x80)]
            public ulong TimeDateStamp;
            [FieldOffset(0x88)]
            public IntPtr  /* _ACTIVATION_CONTEXT* */ EntryPointActivationContext;
            [FieldOffset(0x90)]
            public IntPtr Lock; // 0x90
            [FieldOffset(0x98)]
            public IntPtr /* _LDR_DDAG_NODE* */ DdagNode; // 0x98
            [FieldOffset(0xA0)]
            public LIST_ENTRY NodeModuleLink; // 0xA0
            [FieldOffset(0xB0)]
            public IntPtr  /* _LDRP_LOAD_CONTEXT* */ LoadContext;
            [FieldOffset(0xB8)]
            public IntPtr ParentDllBase;
            [FieldOffset(0xC0)]
            public IntPtr SwitchBackContext;
            [FieldOffset(0xC8)]
            public RTL_BALANCED_NODE BaseAddressIndexNode;
            [FieldOffset(0xE0)]
            public RTL_BALANCED_NODE MappingInfoIndexNode;
            [FieldOffset(0xF8)]
            public ulong OriginalBase;
            [FieldOffset(0x100)]
            public LARGE_INTEGER LoadTime;
            [FieldOffset(0x108)]
            public ulong BaseNameHashValue;
            [FieldOffset(0x10C)]
            public LDR_DLL_LOAD_REASON LoadReason;
            [FieldOffset(0x110)]
            public uint ImplicitPathOptions;
            [FieldOffset(0x114)]
            public uint ReferenceCount;
            [FieldOffset(0x118)]
            public uint DependentLoadFlags;
            [FieldOffset(0x11c)]
            public byte SigningLevel;
            [FieldOffset(0x120)]
            public uint CheckSum;
            [FieldOffset(0x128)]
            public IntPtr ActivePatchImageBase;
            [FieldOffset(0x130)]
            public LDR_HOT_PATCH_STATE HotPatchState;
        }

        public enum LDR_DLL_LOAD_REASON {
            StaticDependency = 0,
            StaticForwarderDependency = 1,
            DynamicForwarderDependency = 2,
            DelayloadDependency = 3,
            DynamicLoad = 4,
            AsImageLoad = 5,
            AsDataLoad = 6,
            EnclavePrimary = 7,
            EnclaveDependency = 8,
            PatchImage = 9,
            Unknown = -1
        }

        public enum LDR_HOT_PATCH_STATE {
            LdrHotPatchBaseImage = 0,
            LdrHotPatchNotApplied = 1,
            LdrHotPatchAppliedReverse = 2,
            LdrHotPatchAppliedForward = 3,
            LdrHotPatchFailedToPatch = 4,
            LdrHotPatchStateMax = 5
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct LDR_DDAG_NODE {
            [FieldOffset(0)]
            public LIST_ENTRY Modules;
            [FieldOffset(0x10)]
            public IntPtr ServiceTagList;
            [FieldOffset(0x18)]
            public ulong LoadCount;
            [FieldOffset(0x1C)]
            public ulong LoadWhileUnloadingCount;
            [FieldOffset(0x20)]
            public ulong LowestLink;
            [FieldOffset(0x28)]
            public IntPtr Dependencies;
            [FieldOffset(0x30)]
            public IntPtr IncomingDependencies;
            [FieldOffset(0x38)]
            public LDR_DDAG_STATE State;
            [FieldOffset(0x40)]
            public IntPtr CondenseLink;
            [FieldOffset(0x48)]
            public ulong PreorderNumber;
        }

        public enum LDR_DDAG_STATE {
            LdrModulesMerged = -5,
            LdrModulesInitError = -4,
            LdrModulesSnapError = -3,
            LdrModulesUnloaded = -2,
            LdrModulesUnloading = -1,
            LdrModulesPlaceHolder = 0,
            LdrModulesMapping = 1,
            LdrModulesMapped = 2,
            LdrModulesWaitingForDependencies = 3,
            LdrModulesSnapping = 4,
            LdrModulesSnapped = 5,
            LdrModulesCondensed = 6,
            LdrModulesReadyToInit = 7,
            LdrModulesInitializing = 8,
            LdrModulesReadyToRun = 9
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct ImageTlsDirectory64 {
            [field: FieldOffset(0x00)]
            public IntPtr StartAddressOfRawData;
            [field: FieldOffset(0x08)]
            public IntPtr EndAddressOfRawData;
            [field: FieldOffset(0x10)]
            public IntPtr AddressOfIndex;
            [field: FieldOffset(0x18)]
            public IntPtr AddressOfCallBacks;
            [field: FieldOffset(0x20)]
            public uint SizeOfZeroFill;
            [field: FieldOffset(0x24)]
            public uint Characteristics;
        };

        [StructLayout(LayoutKind.Explicit)]
        public struct IMAGE_DEBUG_DIRECTORY {
            [FieldOffset(0)]
            public uint Characteristics;
            [FieldOffset(4)]
            public uint TimeDateStamp;
            [FieldOffset(8)]
            public ushort MajorVersion;
            [FieldOffset(10)]
            public ushort MinorVersion;
            [FieldOffset(12)]
            public uint Type;
            [FieldOffset(16)]
            public uint SizeOfData;
            [FieldOffset(20)]
            public uint AddressOfRawData;
            [FieldOffset(24)]
            public uint PointerToRawData;
        };

        [StructLayout(LayoutKind.Explicit)]
        public struct RSDS_PEB {
            [FieldOffset(0x00)]
            public uint CvSig;
            [FieldOffset(0x04)]
            public Guid Guid;
            [FieldOffset(0x14)]
            public uint Age;
            //[FieldOffset(0x18)]
            //public uint String;
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct LARGE_INTEGER {
            [FieldOffset(0)]
            public int Low;
            [FieldOffset(4)]
            public int High;
            [FieldOffset(0)]
            public long QuadPart;

            public long ToInt64() {
                return ((long)this.High << 32) | (uint)this.Low;
            }

            public static LARGE_INTEGER FromInt64(long value) {
                return new LARGE_INTEGER {
                    Low = (int)(value),
                    High = (int)((value >> 32))
                };
            }
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct RTL_BALANCED_NODE {
            public IntPtr /* RTL_BALANCED_NODE* */ Left;
            public IntPtr /* RTL_BALANCED_NODE* */ Right;
            public ulong ParentValue;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct RTL_RB_TREE {
            public IntPtr Root; // RTL_BALANCED_NODE
            public IntPtr Min; // RTL_BALANCED_NODE
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct MEMORY_BASIC_INFORMATION {
            public IntPtr BaseAddress;
            public IntPtr AllocationBase;
            public uint AllocationProtect;
            public IntPtr RegionSize;
            public uint State;
            public uint Protect;
            public uint Type;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct SECURITY_ATTRIBUTES {
            public int nLength;
            public IntPtr lpSecurityDescriptor;
            public bool bInheritHandle;
        }

        [DllImport("kernel32.dll", SetLastError = true)]
        public static extern void SetLastError(uint dwErrorCode);


        [DllImport("kernel32.dll", SetLastError = true)]
        public static extern int ResumeThread(IntPtr handle);

        [DllImport("kernel32.dll", CharSet = CharSet.Auto, SetLastError = true)]
        public static extern bool CreateProcess(
            [MarshalAs(UnmanagedType.LPWStr)]
            string lpApplicationName,
            string lpCommandLine,
            IntPtr lpProcessAttributes,
            IntPtr lpThreadAttributes,
            bool bInheritHandles,
            int dwCreationFlags,
            IntPtr lpEnvironment,
            string lpCurrentDirectory,
            ref STARTUPINFO lpStartupInfo,
            out PROCESS_INFORMATION lpProcessInformation
        );

#nullable enable
        [DllImport("kernel32.dll", SetLastError = true, CharSet = CharSet.Unicode)]
        public static extern bool CreateProcessW(
            [MarshalAs(UnmanagedType.LPWStr)]
            string? lpApplicationName,
            [MarshalAs(UnmanagedType.LPWStr)]
            string? lpCommandLine,
            IntPtr procSecAttrs,
            IntPtr threadSecAttrs,
            bool bInheritHandles,
            uint dwCreationFlags,
            IntPtr lpEnvironment,
            [MarshalAs(UnmanagedType.LPWStr)]
            string? lpCurrentDirectory,
            ref STARTUPINFO lpStartupInfo,
            out PROCESS_INFORMATION lpProcessInformation
        );
#nullable disable

        [DllImport("kernel32.dll", SetLastError = true)]
        public static extern int PsSetCreateThreadNotifyRoutine(
           IntPtr NotifyRoutine
        );

        [DllImport("advapi32.dll", SetLastError = true, CharSet = CharSet.Auto)]
        public static extern bool CreateProcessAsUserW(
            IntPtr hToken,
            string lpApplicationName,
            string lpCommandLine,
            IntPtr lpProcessAttributes,
            IntPtr lpThreadAttributes,
            bool bInheritHandles,
            int dwCreationFlags,
            IntPtr lpEnvironment,
            string lpCurrentDirectory,
            ref STARTUPINFO lpStartupInfo,
            out PROCESS_INFORMATION lpProcessInformation);

        [DllImport("kernel32.dll", SetLastError = true)]
        [return: MarshalAs(UnmanagedType.Bool)]
        public static extern bool GetExitCodeProcess(IntPtr hProcess, out uint lpExitCode);

        [DllImport("kernel32.dll", SetLastError = true)]
        public static extern bool DuplicateHandle(
            IntPtr hSourceProcessHandle,
            IntPtr hSourceHandle,
            IntPtr hTargetProcess,
            out IntPtr lpTargetHandle,
            int dwDesiredAccess,
            bool bInheritHandle,
            int dwOptions
        );

        [DllImport("kernel32.dll")]
        public static extern bool VirtualQueryEx(IntPtr hProcess, IntPtr lpAddress, ref MEMORY_BASIC_INFORMATION lpBuffer, uint dwLength);

        [DllImport("kernel32.dll", SetLastError = true)]
        static extern bool ReadProcessMemory(
            IntPtr hProcess,
            IntPtr lpBaseAddress,
            [Out] byte[] lpBuffer,
            int dwSize,
            out IntPtr lpNumberOfBytesRead);

        [DllImport("kernel32.dll")]
        public static extern bool CreatePipe(out IntPtr hReadPipe, out IntPtr hWritePipe,
            ref SECURITY_ATTRIBUTES lpPipeAttributes, uint nSize);

        [DllImport("kernel32.dll")]
        [return: MarshalAs(UnmanagedType.Bool)]
        public static extern bool SetStdHandle(int nStdHandle, IntPtr hHandle);

        [DllImport("kernel32.dll")]
        public static extern uint GetLastError();

        [DllImport("kernel32.dll", SetLastError = true)]
        public static extern IntPtr GetStdHandle(int nStdHandle);

        [DllImport("kernel32.dll", SetLastError = true)]
        public static extern bool ReadFile(IntPtr hFile, [Out] byte[] lpBuffer,
            uint nNumberOfBytesToRead, out uint lpNumberOfBytesRead, IntPtr lpOverlapped);

        [DllImport("ntdll.dll", SetLastError = true, ExactSpelling = true)]
        public static extern int NtQueryInformationProcess(IntPtr processHandle, int processInformationClass, ref PROCESS_BASIC_INFORMATION processInformation, uint processInformationLength, IntPtr returnLength);

        [DllImport("kernel32")]
        public static extern IntPtr VirtualAlloc(IntPtr lpStartAddr, uint size, uint flAllocationType,
            uint flProtect);

        [DllImport("kernel32.dll", SetLastError = true, CharSet = CharSet.Unicode)]
        public static extern IntPtr LoadLibrary(string lpFileName);

        [DllImport("kernel32.dll", SetLastError = true, CharSet = CharSet.Ansi)]
        public static extern IntPtr LoadLibraryA(string lpFileName);

        [DllImport("kernel32.dll", SetLastError = true, CharSet = CharSet.Unicode)]
        public static extern IntPtr LoadLibraryEx(string lpFileName, IntPtr hFile, int dwFlags);

        [DllImport("kernel32.dll", CharSet = CharSet.Unicode)]
        public static extern IntPtr LoadLibraryExW(string lpLibFileName, IntPtr hFile, uint dwFlags);

        [DllImport("kernel32.dll", SetLastError = true, CharSet = CharSet.Auto)]
        public static extern bool GetModuleHandleEx(uint dwFlags, string lpModuleName, out IntPtr phModule);

        [DllImport("kernel32.dll", SetLastError = true, CharSet = CharSet.Unicode)]
        public static extern bool GetModuleHandleExW(uint dwFlags, string lpModuleName, out IntPtr phModule);

        [DllImport("kernel32.dll", CharSet = CharSet.Auto, SetLastError = true)]
        public static extern uint FormatMessage(uint dwFlags, IntPtr lpSource, uint dwMessageId, uint dwLanguageId, out string lpBuffer, uint nSize, IntPtr[] Arguments);

        [DllImport("kernel32.dll", SetLastError = true)]
        [return: MarshalAs(UnmanagedType.Bool)]
        public static extern bool FreeLibrary(IntPtr hModule);

        [DllImport("kernel32.dll")]
        public static extern uint SuspendThread(IntPtr hThread);

        [DllImport("kernel32.dll")]
        public static extern IntPtr OpenThread(uint dwDesiredAccess, bool bInheritHandle, uint dwThreadId);


        [DllImport("ntdll.dll", CharSet = CharSet.Unicode, ExactSpelling = true)]
        public static extern IntPtr LdrLoadDll(
            string DllPath,
            uint DllCharacteristics,
            ref UNICODE_STRING DllName,
            out IntPtr DllHandle
        );

        [DllImport("kernel32.dll", CharSet = CharSet.Ansi, ExactSpelling = true, SetLastError = true)]
        public static extern IntPtr GetProcAddress(IntPtr hModule, string procName);

        [DllImport("kernel32.dll", CharSet = CharSet.Ansi, ExactSpelling = true, SetLastError = true)]
        public static extern IntPtr GetProcAddress(IntPtr hModule, ulong ordinal);

        [DllImport("kernel32.dll", SetLastError = true)]
        public static extern IntPtr GetCurrentProcess();

        [DllImport("kernel32.dll", CharSet = CharSet.Ansi)]
        public static extern IntPtr GetCommandLineA();

        [DllImport("kernel32.dll", CharSet = CharSet.Unicode)]
        public static extern IntPtr GetCommandLineW();

        [DllImport("kernel32.dll", SetLastError = true)]
        [ReliabilityContract(Consistency.WillNotCorruptState, Cer.Success)]
        [SuppressUnmanagedCodeSecurity]
        [return: MarshalAs(UnmanagedType.Bool)]
        public static extern bool CloseHandle(IntPtr hObject);

        [DllImport("kernel32.dll", SetLastError = true)]
        static extern IntPtr CreateFileMapping(IntPtr hFile, IntPtr lpFileMappingAttributes, uint flProtect, uint dwMaximumSizeHigh, uint dwMaximumSizeLow, string lpName);

        [DllImport("kernel32")]
        public static extern IntPtr CreateThread(IntPtr lpThreadAttributes, uint dwStackSize, IntPtr lpStartAddress,
            IntPtr param, uint dwCreationFlags, ref IntPtr lpThreadId);

        [DllImport("kernel32.dll", SetLastError = true)]
        public static extern bool VirtualProtect(IntPtr lpAddress, UIntPtr dwSize, uint flNewProtect, out uint lpFlOldProtect);

        [DllImport("kernel32.dll", CharSet = CharSet.Auto)]
        public static extern IntPtr GetModuleHandle(string lpModuleName);

        [DllImport("kernel32.dll", SetLastError = true)]
        [PreserveSig]
        public static extern uint GetModuleFileName(IntPtr hModule, StringBuilder lpFilename, [MarshalAs(UnmanagedType.U4)] int nSize);

        [DllImport("kernel32.dll", SetLastError = true, ExactSpelling = true)]
        public static extern bool VirtualFree(IntPtr pAddress, uint size, uint freeType);

        [DllImport("kernel32.dll")]
        public static extern uint WaitForSingleObject(IntPtr hHandle, uint dwMilliseconds);

        [DllImport("kernel32.dll")]
        public static extern uint WaitForMultipleObjects(uint nCount, IntPtr[] lpHandles, bool bWaitAll, uint dwMilliseconds);

        [DllImport("user32.dll")]
        public static extern uint  MsgWaitForMultipleObjects(uint nCount, IntPtr[] pHandles, bool bWaitAll, int dwMilliseconds, uint dwWakeMask);

        [DllImport("shell32.dll", SetLastError = true, CharSet = CharSet.Unicode)]
        public static extern IntPtr CommandLineToArgvW([MarshalAs(UnmanagedType.LPWStr)] string lpCmdLine, out int pNumArgs);

        public class QueueStatusFlags {
            public const uint QS_KEY = 0x0001;
            public const uint QS_MOUSEMOVE = 0x0002;
            public const uint QS_MOUSEBUTTON = 0x0004;
            public const uint QS_POSTMESSAGE = 0x0008;
            public const uint QS_TIMER = 0x0010;
            public const uint QS_PAINT = 0x0020;
            public const uint QS_SENDMESSAGE = 0x0040;
            public const uint QS_HOTKEY = 0x0080;
            public const uint QS_ALLPOSTMESSAGE = 0x0100;
            public const uint QS_EVENT = 0x02000;
            public const uint QS_MOUSE = QS_MOUSEMOVE | QS_MOUSEBUTTON;
            public const uint QS_INPUT = QS_MOUSE | QS_KEY;
            public const uint QS_ALLEVENTS = QS_INPUT | QS_POSTMESSAGE | QS_TIMER | QS_PAINT | QS_HOTKEY;
            public const uint QS_ALLINPUT = QS_INPUT | QS_POSTMESSAGE | QS_TIMER | QS_PAINT | QS_HOTKEY | QS_SENDMESSAGE;
        }

        public static class FormatMessageFlags {
            public const uint FORMAT_MESSAGE_ALLOCATE_BUFFER = 0x00000100;
            public const uint FORMAT_MESSAGE_IGNORE_INSERTS = 0x00000200;
            public const uint FORMAT_MESSAGE_FROM_STRING = 0x00000400;
            public const uint FORMAT_MESSAGE_FROM_HMODULE = 0x00000800;
            public const uint FORMAT_MESSAGE_FROM_SYSTEM = 0x00001000;
            public const uint FORMAT_MESSAGE_ARGUMENT_ARRAY = 0x00002000;
            public const uint FORMAT_MESSAGE_MAX_WIDTH_MASK = 0x000000FF;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct UNICODE_STRING : IDisposable {
            public ushort Length;
            public ushort MaximumLength;
            private IntPtr buffer;

            public UNICODE_STRING(string s) {
                Length = (ushort)(s.Length * 2);
                MaximumLength = (ushort)(Length + 2);
                buffer = Marshal.StringToHGlobalUni(s);
            }

            public void Dispose() {
                Marshal.FreeHGlobal(buffer);
                buffer = IntPtr.Zero;
            }

            public override string ToString() {
                return Marshal.PtrToStringUni(buffer);
            }
        }

        public static IntPtr GetPEBAddress(IntPtr hProcess) {

            PROCESS_BASIC_INFORMATION processInformation = new PROCESS_BASIC_INFORMATION { };
            var result = NtQueryInformationProcess(hProcess, 0, ref processInformation, (uint)Marshal.SizeOf<PROCESS_BASIC_INFORMATION>(), IntPtr.Zero);

            if (result != 0) {
                throw new Win32Exception(Marshal.GetLastWin32Error());
            }

            return processInformation.PebAddress;
        }

        public static ulong CreateCacheKey(UNICODE_STRING BaseDllName) {
            ulong hash = 0;
            RtlHashUnicodeString(ref BaseDllName, true, 0, ref hash);
            hash &= (32 - 1); // LDR_HASH_TABLE_ENTRIES = 32
            return hash;
        }

        // Find LdrpHashTable address
        // https://github.com/DarthTon/Blackbone/blob/master/src/BlackBone/ManualMap/Native/NtLoader.cpp#L153
        public static IntPtr FindLdrpHashTable() {
            IntPtr pHead = IntPtr.Zero;
            IntPtr pEntry = IntPtr.Zero;
            IntPtr pCurrentEntry = IntPtr.Zero; // PLDR_DATA_TABLE_ENTRY2

            IntPtr pebAddress = GetPEBAddress(Process.GetCurrentProcess().Handle);
            PEB peb = (PEB)Marshal.PtrToStructure(pebAddress, typeof(PEB));
            PEB_LDR_DATA ldr = (PEB_LDR_DATA)Marshal.PtrToStructure(peb.Ldr, typeof(PEB_LDR_DATA));

            int offset = 0x20;
            pHead = peb.Ldr + offset; // InInitializationOrderLinks
            pEntry = ldr.InInitializationOrderLinks.Flink;

            do {
                pCurrentEntry = pEntry - offset;
                LDR_DATA_TABLE_ENTRY entry = (LDR_DATA_TABLE_ENTRY) Marshal.PtrToStructure(pCurrentEntry, typeof(LDR_DATA_TABLE_ENTRY));

                pEntry = entry.InInitializationOrderLinks.Flink;

                // ntdll.dll always is the first record in the hash table for it's hash
                if (entry.BaseDllName.ToString().ToLower() == "ntdll.dll") {
                    // Return the record *before* this first record, as it is the record in the actual LdrpHashTable
                    IntPtr pList = new IntPtr(entry.HashLinks.Blink.ToInt64() - (long)(CreateCacheKey(entry.BaseDllName) * (ulong)Marshal.SizeOf<LIST_ENTRY>()));
                    Logger.Log($"Found Hash table at 0x{pList:X} (0x{pList.ToInt64()-LoadLibrary("ntdll.dll").ToInt64():X})", Logger.LogLevel.TRACE);
                    return pList;
                }
                /*
                // Hashlinks points to itself
                IntPtr pHashLinks = (pCurrentEntry + 0x70);
                if (entry.HashLinks.Flink == pHashLinks) {
                    continue;
                }

                pList = entry.HashLinks.Flink;
                var blah = (LDR_DATA_TABLE_ENTRY)Marshal.PtrToStructure(IntPtr.Subtract(entry.HashLinks.Flink, Marshal.OffsetOf<LDR_DATA_TABLE_ENTRY>("HashLinks").ToInt32()), typeof(LDR_DATA_TABLE_ENTRY));
                Logger.Log($"{pList} {entry.BaseDllName} -> {blah.BaseDllName} ({CreateCacheKey(entry.BaseDllName)} -> {CreateCacheKey(blah.BaseDllName)})");
                LIST_ENTRY list = (LIST_ENTRY)Marshal.PtrToStructure(pList, typeof(LIST_ENTRY));

                // Last item
                if (list.Flink == pHashLinks) {
                    pList = new IntPtr(entry.HashLinks.Flink.ToInt64() - (long)(CreateCacheKey(entry.BaseDllName) * (ulong)Marshal.SizeOf<LIST_ENTRY>()));
                    Logger.Log($"Found Hash table at 0x{pList:X}", Logger.LogLevel.TRACE);
                    break;
                }
                */

            } while (pHead != pEntry);

            throw new Exception("Unable to find HashTable address");
        }

        // UWP won't allow importing from ntdll.dll
        public delegate int LdrUnlockLoaderLockDelegate(ulong flags, ulong cookie);
        public static int LdrUnlockLoaderLock(ulong flags, ulong cookie) {
            return GetDelegate<LdrUnlockLoaderLockDelegate>("ntdll.dll", "LdrUnlockLoaderLock")(flags, cookie);
        }

        // UWP won't allow importing from ntdll.dll
        public delegate int LdrLockLoaderLockDelegate(ulong Flags, ref ulong State, ref ulong Cookie);
        public static int LdrLockLoaderLock(ulong Flags, ref ulong State, ref ulong Cookie) {
            return GetDelegate<LdrLockLoaderLockDelegate>("ntdll.dll", "LdrLockLoaderLock")(Flags, ref State, ref Cookie);
        }

        // UWP won't allow importing from ntdll.dll
        public delegate int RtlRbInsertNodeExDelegate(IntPtr Tree, IntPtr Parent, bool Right, IntPtr Node);
        public static int RtlRbInsertNodeEx(IntPtr Tree, IntPtr Parent, bool Right, IntPtr Node) {
            return GetDelegate<RtlRbInsertNodeExDelegate>("ntdll.dll", "RtlRbInsertNodeEx")(Tree, Parent, Right, Node);
        }

        public delegate uint RtlHashUnicodeStringDelegate(ref UNICODE_STRING String, bool CaseInsensitive, ulong HashAlgorithm, ref ulong HashValue);
        public static uint RtlHashUnicodeString(ref UNICODE_STRING String, bool CaseInsensitive, ulong HashAlgorithm, ref ulong HashValue) {
            return GetDelegate<RtlHashUnicodeStringDelegate>("ntdll.dll", "RtlHashUnicodeString")(ref String, CaseInsensitive, HashAlgorithm, ref HashValue);
        }

        public static T GetDelegate<T>(string DllName, string FunctionName) {
            var moduleHandle = GetModuleHandle(DllName);
            if (moduleHandle == IntPtr.Zero) {
                Logger.Log($"{DllName} is not loaded, natively loading...");
                moduleHandle = LoadLibrary(DllName);
                if (moduleHandle == IntPtr.Zero) {
                    throw new Exception($"Cannot natively load the DLL {DllName} for method delegation");
                }
            }
            //Logger.Log($"moduleHandle 0x{moduleHandle:X} ({DllName})");
            var functionHandle = GetProcAddress(moduleHandle, FunctionName);
            if(functionHandle == IntPtr.Zero) {
                throw new Exception($"Cannot find {DllName}!{FunctionName}");
            }
            //Logger.Log($"functionHandle 0x{functionHandle:X} ({FunctionName})");
            return Marshal.GetDelegateForFunctionPointer<T>(functionHandle);
        }

        public static RTL_RB_TREE GetLdrpModuleBaseAddressIndex() {
            return (RTL_RB_TREE)Marshal.PtrToStructure(GetLdrpModuleBaseAddressIndexAddress(), typeof(RTL_RB_TREE));
        }

        public static void DumpMemoryAtAddress(IntPtr address) {
            byte[] bytes = new byte[256];
            for (int i = 0; i < bytes.Length; i++) {
                bytes[i] = Marshal.ReadByte(address + i);
            }
            for (int i = 0; i < bytes.Length; i++) {
                if (i % 16 == 0) {
                    Console.Write("\n");
                }
                Console.Write($"{bytes[i]:X2} ");
            }
            Console.Write("\n");
        }

        // TODO: Switch this to RtlAddFunctionTable ?
        delegate uint RtlInsertInvertedFunctionTableDelegate(IntPtr DllBaseAddress, uint SizeOfImage);
        public static uint RtlInsertInvertedFunctionTable(IntPtr DllBaseAddress, uint SizeOfImage) {
            var function = Marshal.GetDelegateForFunctionPointer<RtlInsertInvertedFunctionTableDelegate>(GetRtlInsertInvertedFunctionTableAddress());
            return function(DllBaseAddress, SizeOfImage);
        }

        delegate uint LdrpHandleTlsDataDelegate(IntPtr PEBLoaderDataTableEntryAddress);
        public static uint LdrpHandleTlsData(IntPtr PEBLoaderDataTableEntryAddress) {
            // calls ntdll!LdrpHandleTlsData 
            var function = Marshal.GetDelegateForFunctionPointer<LdrpHandleTlsDataDelegate>(GetLdrpHandleTlsDataAddress());
            return function(PEBLoaderDataTableEntryAddress);
        }

        delegate uint LdrpReleaseTlsEntryDelegate(IntPtr PEBLoaderDataTableEntryAddress, out IntPtr RemovedTlsEntry);
        public static uint LdrpReleaseTlsEntry(IntPtr PEBLoaderDataTableEntryAddress) {
            // calls ntdll!LdrpReleaseTlsEntry
            var function = Marshal.GetDelegateForFunctionPointer<LdrpReleaseTlsEntryDelegate>(GetLdrpReleaseTlsEntryAddress());
            var removedTlsEntry = IntPtr.Zero;
            return function(PEBLoaderDataTableEntryAddress, out removedTlsEntry);
        }

        public const string NTDLL_GUID_PC = "e9bf26fa-c25f-2ac5-9a4e-bbbc29569688"; // 10.0.22631.4169
        public const string NTDLL_GUID_XBOX_2864 = "dcb12335-6c21-d9d2-6072-ad27af83e1aa"; // 10.0.22621.2864 (Nov 2022)
        public const string NTDLL_GUID_XBOX_4908_4909 = "c30d51bc-364d-2253-0808-24ef4382db62"; // 10.0.25398.4909 & 10.0.25398.4908
        public const string NTDLL_GUID_XBOX_4478 = "4a9c1d0f-33d3-b2fd-ce7d-0e4c3e5c4941"; // 10.0.25398.4478

        // find ntdll!LdrpModuleBaseAddressIndex variable
        // TODO: Make this more portable: https://www.mdsec.co.uk/2021/06/bypassing-image-load-kernel-callbacks/
        public static IntPtr GetLdrpModuleBaseAddressIndexAddress() {
            switch (GetDebugGuid("ntdll.dll")) {
                case NTDLL_GUID_PC:
                    return GetModuleHandle("ntdll.dll") + 0x187108;
                case NTDLL_GUID_XBOX_2864:
                    return GetModuleHandle("ntdll.dll") + 0x185008;
                case NTDLL_GUID_XBOX_4908_4909:
                case NTDLL_GUID_XBOX_4478:
                    return GetModuleHandle("ntdll.dll") + 0x196998;
            }
            throw new Exception($"Unknown Dll debug PDB GUID: {GetDebugGuid("ntdll.dll")}");
        }

        // find ntdll!RtlInsertInvertedFunctionTable method
        public static IntPtr GetRtlInsertInvertedFunctionTableAddress() {
            switch (GetDebugGuid("ntdll.dll")) {
                case NTDLL_GUID_PC:
                    return GetModuleHandle("ntdll.dll") + 0x2C0BC;
                case NTDLL_GUID_XBOX_2864:
                    return GetModuleHandle("ntdll.dll") + 0x2C2AC;
                case NTDLL_GUID_XBOX_4908_4909:
                case NTDLL_GUID_XBOX_4478:
                    return GetModuleHandle("ntdll.dll") + 0x2B854;
            }
            throw new Exception($"Unknown Dll debug PDB GUID: {GetDebugGuid("ntdll.dll")}");
        }

        // find ntdll!LdrpHandleTlsData method
        public static IntPtr GetLdrpHandleTlsDataAddress() {
            switch (GetDebugGuid("ntdll.dll")) {
                case NTDLL_GUID_PC:
                    return GetModuleHandle("ntdll.dll") + 0x44F8;
                case NTDLL_GUID_XBOX_2864:
                    return GetModuleHandle("ntdll.dll") + 0x4564;
                case NTDLL_GUID_XBOX_4908_4909:
                case NTDLL_GUID_XBOX_4478:
                    return GetModuleHandle("ntdll.dll") + 0x63F44;
            }
            throw new Exception($"Unknown Dll debug PDB GUID: {GetDebugGuid("ntdll.dll")}");
        }

        // find ntdll!LdrpReleaseTlsEntry method
        public static IntPtr GetLdrpReleaseTlsEntryAddress() {
            switch (GetDebugGuid("ntdll.dll")) {
                case NTDLL_GUID_PC:
                    return GetModuleHandle("ntdll.dll") + 0x7FEEC;
                case NTDLL_GUID_XBOX_2864:
                    return GetModuleHandle("ntdll.dll") + 0x7F7AC;
                case NTDLL_GUID_XBOX_4908_4909:
                    return GetModuleHandle("ntdll.dll") + 0x81DC0;
                case NTDLL_GUID_XBOX_4478:
                    return GetModuleHandle("ntdll.dll") + 0x81E20;
            }
            throw new Exception($"Unknown Dll debug PDB GUID: {GetDebugGuid("ntdll.dll")}");
        }

        /*
        // find ntdll!LdrpFindLoadedDllByAddress method
        public static IntPtr LdrpFindLoadedDllByAddress() {
            switch (GetDebugGuid("ntdll.dll")) {
                case NTDLL_GUID_PC:
                    return GetModuleHandle("ntdll.dll") + 0x8A80;
                case NTDLL_GUID_XBOX_4909:
                    return GetModuleHandle("ntdll.dll") + 0x63240;
                case NTDLL_GUID_XBOX_4478:
                    return GetModuleHandle("ntdll.dll") + 0x0; // TODO
            }
            throw new Exception($"Unknown Dll debug PDB GUID: {GetDebugGuid("ntdll.dll")}");
        }
        */

        public static String GetDebugGuid(string dllName) {
            IntPtr moduleHandle = GetModuleHandle(dllName);
            PEImage pe = PEImage.PEReader.ParseLoadedModule(moduleHandle);
            if (pe.OptionalHeader64.Debug.Size == 0) {
                throw new Exception($"No debug directory for {dllName}");
            }

            Logger.Log($"pe.OptionalHeader64.Debug.VirtualAddress = 0x{pe.OptionalHeader64.Debug.VirtualAddress:X}", Logger.LogLevel.TRACE);
            for (var pDebugDirectory = new IntPtr(moduleHandle.ToInt64() + pe.OptionalHeader64.Debug.VirtualAddress);
                pDebugDirectory.ToInt64() < (moduleHandle.ToInt64() + pe.OptionalHeader64.Debug.VirtualAddress + pe.OptionalHeader64.Debug.Size);
                pDebugDirectory += Marshal.SizeOf<IMAGE_DEBUG_DIRECTORY>()) {

                Logger.Log($"pDebugDirectory = 0x{pDebugDirectory:X}", Logger.LogLevel.TRACE);
                var debugDirectory = Marshal.PtrToStructure<IMAGE_DEBUG_DIRECTORY>(pDebugDirectory);

                Logger.Log($"debugDirectory.Characteristics = 0x{debugDirectory.Characteristics:X}", Logger.LogLevel.TRACE);
                Logger.Log($"debugDirectory.TimeDateStamp = 0x{debugDirectory.TimeDateStamp:X}", Logger.LogLevel.TRACE);
                Logger.Log($"debugDirectory.MajorVersion = 0x{debugDirectory.MajorVersion:X}", Logger.LogLevel.TRACE);
                Logger.Log($"debugDirectory.MinorVersion = 0x{debugDirectory.MinorVersion:X}", Logger.LogLevel.TRACE);
                Logger.Log($"debugDirectory.Type = 0x{debugDirectory.Type:X}", Logger.LogLevel.TRACE);
                Logger.Log($"debugDirectory.SizeOfData = 0x{debugDirectory.SizeOfData:X}", Logger.LogLevel.TRACE);
                Logger.Log($"debugDirectory.AddressOfRawData = 0x{debugDirectory.AddressOfRawData:X}", Logger.LogLevel.TRACE);
                Logger.Log($"debugDirectory.PointerToRawData = 0x{debugDirectory.PointerToRawData:X}", Logger.LogLevel.TRACE);

                if (debugDirectory.Type == 0x02) { // IMAGE_DEBUG_TYPE_CODEVIEW

                    var rsds = Marshal.PtrToStructure<RSDS_PEB>(new IntPtr(moduleHandle.ToInt64() + debugDirectory.AddressOfRawData));

                    if (rsds.CvSig != 0x53445352) {
                        throw new Exception("Expected CvSig 'RSDS'");
                    }
                    Logger.Log($"rsds.CvSig = 0x{rsds.CvSig:X}", Logger.LogLevel.TRACE);
                    Logger.Log($"rsds.Age = 0x{rsds.Age:X}", Logger.LogLevel.TRACE);
                    Logger.Log($"rsds.Guid = {rsds.Guid}", Logger.LogLevel.TRACE);

                    return rsds.Guid.ToString();
                }
            }

            throw new Exception("Could not find IMAGE_DEBUG_TYPE_CODEVIEW in IMAGE_DEBUG_DIRECTORY");
        }

        public const int LOGON32_PROVIDER_DEFAULT = 0;
        public const int LOGON32_PROVIDER_VIRTUAL = 4;

        public const int LOGON32_LOGON_INTERACTIVE = 2;
        public const int LOGON32_LOGON_SERVICE = 5;

        [DllImport("kernel32.dll", ExactSpelling = true)]
        public static extern IntPtr GetCurrentThread();

        [DllImport("kernel32.dll", ExactSpelling = true)]
        public static extern IntPtr GetCurrentThreadId();

        [DllImport("advapi32.dll", ExactSpelling = true, SetLastError = true)]
        public static extern bool OpenProcessToken(IntPtr ProcessHandle, uint DesiredAccess, out IntPtr TokenHandle);

        [DllImport("advapi32.dll", ExactSpelling = true)]
        public static extern bool OpenThreadToken(IntPtr ThreadHandle, UInt32 DesiredAccess, Boolean OpenAsSelf, out IntPtr TokenHandle);

        [DllImport("advapi32.dll", SetLastError = true)]
        public static extern bool GetTokenInformation(IntPtr hToken, uint tokenInformationClass, IntPtr lpData, uint tokenInformationLength, out uint returnLength);

        [DllImport("advapi32.dll", CharSet = CharSet.Unicode, SetLastError = true)]
        public static extern bool LookupPrivilegeValue(string lpsystemname, string lpname, ref LUID lpLuid);

        [DllImport("advapi32.dll", SetLastError = true, CharSet = CharSet.Unicode)]
        public static extern bool LogonUser(String lpszUsername, String lpszDomain, String lpszPassword, int dwLogonType, int dwLogonProvider, out SafeAccessTokenHandle phToken);

        [DllImport("advapi32.dll", SetLastError = true, CharSet = CharSet.Auto)]
        public static extern bool LookupPrivilegeName(
            string lpSystemName,
            ref LUID lpLuid,
            StringBuilder lpName,
            ref int cchName);

        [DllImport("advapi32.dll", CharSet = CharSet.Unicode, SetLastError = true)]
        public static extern bool AdjustTokenPrivileges(IntPtr TokenHandle, bool DisableAllPrivileges, ref UPDATE_TOKEN_PRIVILEGES NewState, uint Bufferlength, IntPtr PreviousState, IntPtr ReturnLength);

        [DllImport("advapi32.dll", ExactSpelling = true, SetLastError = true)]
        public static extern bool PrivilegeCheck(IntPtr ClientToken, ref PRIVILEGE_SET RequiredPrivileges, out bool pfResult);

        [DllImport("advapi32.dll", SetLastError = true)]
        public static extern uint AllocateAndInitializeSid
        (
            ref SID_IDENTIFIER_AUTHORITY siaNtAuthority,
            byte nSubAuthorityCount,
            uint dwSubAuthority0,
            uint dwSubAuthority1,
            uint dwSubAuthority2,
            uint dwSubAuthority3,
            uint dwSubAuthority4,
            uint dwSubAuthority5,
            uint dwSubAuthority6,
            uint dwSubAuthority7,
            out IntPtr pSid
        );

        [DllImport("advapi32.dll")]
        public static extern long LsaClose(IntPtr objectHandle);

        [DllImport("advapi32.dll")]
        public static extern long LsaNtStatusToWinError(long status);

        [DllImport("advapi32.dll", SetLastError = true, PreserveSig = true)]
        public static extern uint LsaAddAccountRights(
            IntPtr PolicyHandle, IntPtr AccountSid,
            LSA_UNICODE_STRING[] UserRights,
            long CountOfRights);

        [DllImport("advapi32.dll", PreserveSig = true)]
        public static extern uint LsaOpenPolicy(
            ref LSA_UNICODE_STRING SystemName,
            ref LSA_OBJECT_ATTRIBUTES ObjectAttributes,
            int DesiredAccess,
            out IntPtr PolicyHandle);

        [DllImport("advapi32.dll", SetLastError = true)]
        public static extern uint LsaOpenPolicy(
           ref LSA_UNICODE_STRING SystemName,
           ref LSA_OBJECT_ATTRIBUTES ObjectAttributes,
           uint DesiredAccess,
           out IntPtr PolicyHandle
        );

        [DllImport("advapi32.dll", CharSet = CharSet.Unicode)]
        public static extern uint LsaManageSidNameMapping(
            LSA_SID_NAME_MAPPING_OPERATION_TYPE OperationType,
            IntPtr OperationInput,
            out IntPtr OperationOutput);

        [DllImport("advapi32.dll")]
        public static extern int LsaFreeMemory(IntPtr Buffer);

        public delegate IntPtr OpenEventLogDelegate(string lpUNCServerName, string lpSourceName);
        public static IntPtr OpenEventLog(string lpUNCServerName, string lpSourceName) {
            return GetDelegate<OpenEventLogDelegate>("advapi32.dll", "OpenEventLogA")(lpUNCServerName, lpSourceName);
        }

        public delegate bool ReadEventLogDelegate(
            IntPtr hEventLog,
            READ_EVENTLOG_FLAGS dwReadFlags,
            uint dwRecordOffset,
            IntPtr lpBuffer,
            uint nNumberOfBytesToRead,
            ref uint pnBytesRead,
            ref uint pnMinNumberOfBytesNeeded);
        public static bool ReadEventLog(
            IntPtr hEventLog,
            READ_EVENTLOG_FLAGS dwReadFlags,
            uint dwRecordOffset,
            IntPtr lpBuffer,
            uint nNumberOfBytesToRead,
            ref uint pnBytesRead,
            ref uint pnMinNumberOfBytesNeeded) {
            return GetDelegate<ReadEventLogDelegate>("advapi32.dll", "ReadEventLogA")(hEventLog, dwReadFlags, dwRecordOffset, lpBuffer, nNumberOfBytesToRead, ref pnBytesRead, ref pnMinNumberOfBytesNeeded);
        }

        [Flags]
        public enum READ_EVENTLOG_FLAGS : uint {
            EVENTLOG_SEEK_READ = 0x0002,
            EVENTLOG_SEQUENTIAL_READ = 0x0001,
            EVENTLOG_FORWARDS_READ = 0x0004,
            EVENTLOG_BACKWARDS_READ = 0x0008,
            EVENTLOG_SEEK_FORWARDS = EVENTLOG_SEEK_READ | EVENTLOG_FORWARDS_READ,
            EVENTLOG_SEEK_BACKWARDS = EVENTLOG_SEEK_READ | EVENTLOG_BACKWARDS_READ,
            EVENTLOG_SEQUENTIAL_FORWARDS = EVENTLOG_SEQUENTIAL_READ | EVENTLOG_FORWARDS_READ,
            EVENTLOG_SEQUENTIAL_BACKWARDS = EVENTLOG_SEQUENTIAL_READ | EVENTLOG_BACKWARDS_READ
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct EVENTLOGRECORD {
            [FieldOffset(0x00)]
            public int Length;
            [FieldOffset(0x04)]
            public int Reserved;
            [FieldOffset(0x08)]
            public int RecordNumber;
            [FieldOffset(0x0c)]
            public int TimeGenerated;
            [FieldOffset(0x10)]
            public int TimeWritten;
            [FieldOffset(0x14)]
            public int EventID;
            [FieldOffset(0x18)]
            public short EventType;
            [FieldOffset(0x1a)]
            public short NumStrings;
            [FieldOffset(0x1c)]
            public short EventCategory;
            [FieldOffset(0x1e)]
            public short ReservedFlags;
            [FieldOffset(0x20)]
            public int ClosingRecordNumber;
            [FieldOffset(0x24)]
            public int StringOffset;
            [FieldOffset(0x28)]
            public int UserSidLength;
            [FieldOffset(0x2c)]
            public int UserSidOffset;
            [FieldOffset(0x30)]
            public int DataLength;
            [FieldOffset(0x34)]
            public int DataOffset;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct LSA_SID_NAME_MAPPING_OPERATION_OUTPUT {
            public LSA_SID_NAME_MAPPING_OPERATION_ERROR ErrorCode;
        }
        public enum LSA_SID_NAME_MAPPING_OPERATION_ERROR {
            Success,
            NonMappingError,
            NameCollision,
            SidCollision,
            DomainNotFound,
            DomainSidPrefixMismatch = 6,
            MappingNotFound = 7
        }

        public enum LSA_SID_NAME_MAPPING_OPERATION_TYPE {
            Add,
            Remove,
            AddMultiple,
        }

        public const string VIRTUALUSER_DOMAIN = "VIRTUAL USERS";
        public const string VIRTUALUSER_GROUP_NAME = "ALL VIRTUAL USERS";

        [StructLayout(LayoutKind.Sequential, CharSet = CharSet.Unicode)]
        public struct LSA_SID_NAME_MAPPING_OPERATION_ADD_INPUT {
            public UNICODE_STRING DomainName;
